results_workloada_load.txt
[OVERALL], RunTime(ms), 64717
[OVERALL], Throughput(ops/sec), 15451.890538807424
[TOTAL_GCS_G1_Young_Generation], Count, 9
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 139
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2147812784894232
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 139
[TOTAL_GC_TIME_%], Time(%), 0.2147812784894232
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 453.75
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 1605
[CLEANUP], 50thPercentileLatency(us), 15
[CLEANUP], 95thPercentileLatency(us), 1605
[CLEANUP], 99thPercentileLatency(us), 1605
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 1026.719694
[INSERT], MinLatency(us), 37
[INSERT], MaxLatency(us), 40031
[INSERT], 50thPercentileLatency(us), 149
[INSERT], 95thPercentileLatency(us), 3543
[INSERT], 99thPercentileLatency(us), 4103
[INSERT], Return=OK, 1000000